Tekla Open API Reference for Tekla Structures 2025
ModificationInfo Fields
The ModificationInfo type exposes the following members.
Fields
Name | Description
Deleted
List of objects which have been deleted
Modified
List of objects which have been modified or created. Objects which have only attribute (UDA) changed, and/or which has been numbered since last take are excluded.
ModifiedWithInfo
 The modified objects with information of modification type. Objects which have only attribute (UDA) changed, and/or which has been numbered since last take are included.
Top
See Also
Reference
ModificationInfo Structure
Tekla.Structures.Model.History Namespace